<template>
  <div class="dashboard-container">
    <div class="app-container">
      <h1># 注意事项(约定)：</h1>
      <br>
      <h3>1. 流程图id 不要重复，如果id重复了上传后，这个流程图的version不是1</h3>
      <h3>2. 动态表单里的id 必须要和当前任务节点的id一样</h3>
      <h3>3. 流程控制实际应用种类很多，这里默认有参启动实例，无业务id，动态表单，如果需要业务id 就不做动态表单了，动态参数请和画的bpmn 保持一直。</h3>
      <h3>4. 启动流程会区分是否带参数启动和不带参数启动，如果带参数启动，那么请配置第一个节点的执行人的uel表达式，例如：${user} 并且目前只配置执行人，并且是1人</h3>
      <h3>5. 表单创建的约定：(1) formKey 必须和当前任务节点的id 一样.(2)表单的每行参数通过FormFeild的名字来获取并且通过 -_!来区分参数和名字 格式约定为 ：FormProperty_1hbdgpb-_!string-_!姓名-_!请输入姓名-_!f
        其中有 表单的 formFeild原本的id + 分隔符+ 参数类型 + 分隔符 + 参数名称 + 分隔符 + 参数默认值可用是无 + 分隔符 + 参数类型f
        如果参数类似是f 代表这个不是 uel表达式需要传递的参数，只是一个普通的值那么就不会被uel表达式使用
        <br>
      </h3>
      <h3>6. 我们约定每一个流程的名称开以部门名称+流程的类型定义，这样可用为每个部门设置独立的请假流程，例如IT应用请假，IT基础架构报销 那么我们会去请申请人所在的部门，获取他的的部门所创建的请假流程。
        同时我们对流程定义的key使用格式是 部门简写+数组结尾，例如 SXB_1 末尾1代表普通员工，2代表主管，3代表经理。但是我认为经理需要重新单独建个流程。
      </h3>
      <h3>
        7. 我们约定撤销task的全局变量 监听器的参数设置 格式是 key = 需要撤回的节点Activity_xxxx , value = 当前审批节点的Activity_xxx id + 当前节点配置的任务消失事件的名称，全部配置在审批人这个节点的任务监听器的java类里 格式例子：Activity_1rhajeb!_!Message_2oq4gh2` 通过 `!_!` 来分割
      </h3>
    </div>
  </div>
</template>

<script>
export default {
}
</script>

<style>

</style>
